--Вывести автора, название, количество, цену (Розничная_цена). 
--Для тех книг количество которых больше или равно 10, 
--отобразить оптовую скидку 15% (Скидка), 
--округлить до двух знаков после запятой и вывести оптовую цену с учетом скидки -15% (Оптовая_цена). 
--Все атрибуты перевести на русский язык. 
--Отсортировать по автору и названию книги.

SELECT author AS "Автор", title AS "Название_книги", amount AS "Количество", price AS "Розничная_цена",
    IF (amount >= 10, 15, 0) AS "Скидка",
    round (IF (amount >= 10, price * 0.85, price), 2) AS "Оптовая_цена"    
FROM book
ORDER BY author, title;
