--Для каждого вопроса вывести процент успешных решений, 
--то есть отношение количества верных ответов к общему количеству ответов, 
--значение округлить до 2-х знаков после запятой. 
--Также вывести название предмета, к которому относится вопрос, 
--и общее количество ответов на этот вопрос. 
--В результат включить название дисциплины, вопросы по ней (столбец назвать Вопрос), 
--а также два вычисляемых столбца Всего_ответов и Успешность. 
--Информацию отсортировать сначала по названию дисциплины, 
--потом по убыванию успешности, а потом по тексту вопроса в алфавитном порядке.

SELECT name_subject, 
       CONCAT(LEFT(name_question, 30), '...') AS Вопрос, 
       COUNT(t.answer_id) AS Всего_ответов, 
       ROUND(SUM(is_correct) / COUNT(t.answer_id) * 100, 2) AS Успешность
  FROM subject
       JOIN question USING(subject_id)
       JOIN testing t USING(question_id)
       LEFT JOIN answer a USING(answer_id)
 GROUP BY 1, 2
 ORDER BY 1, 4 DESC, 2;